In [4]:
import pandas as pd

In [7]:
# -- read file
df  = pd.read_csv('prueba.csv')
df.head()

  first_name         last_name  age
0    Anyelin  Calderon Sequera   42

In [8]:
# -- crear dataframe
clients = {'first_name' : ['Oralie' ,'Imojean' ,'Michele', 'Ailbert', 'Stevy'],
           'last_name' : ['Fidgeon split' ,'Benet split' ,'Woodlands split', 'Risdale split', 'MacGorman split'],
           'age' : [30 ,21 ,29 ,22, 24]}

clients = pd.DataFrame(clients, columns = ['first_name', 'last_name', 'age'])
clients

  first_name        last_name  age
0     Oralie    Fidgeon split   30
1    Imojean      Benet split   21
2    Michele  Woodlands split   29
3    Ailbert    Risdale split   22
4      Stevy  MacGorman split   24

In [9]:
# -- otro datafrema
invoices = {'invoice_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
            'client_id' : [3, 2, 7, 2, 7, 3, 1, 4 ,2, 3, 6, 2],
            'amount': [77.91, 24.36, 74.65, 19.75, 27.46, 17.13, 45.77, 81.7, 14.41, 52.69, 32.03, 12.78]}
invoices = pd.DataFrame(invoices, columns = ['invoice_id', 'client_id', 'amount'])
invoices

    invoice_id  client_id  amount
0            1          3   77.91
1            2          2   24.36
2            3          7   74.65
3            4          2   19.75
4            5          7   27.46
5            6          3   17.13
6            7          1   45.77
7            8          4   81.70
8            9          2   14.41
9           10          3   52.69
10          11          6   32.03
11          12          2   12.78

In [11]:
# -- recorrer dataframe por columna
for i, row in clients.iterrows():
    # -- print(row) registro completo
    print (clients['first_name'][i])

Oralie
Imojean
Michele
Ailbert
Stevy

In [12]:
# -- Operaciones de String
clients['first_name'] = clients['first_name'].str.upper()
clients['last_name'] = clients['last_name'].str.split(' ')

clients

  first_name           last_name  age
0     ORALIE    [Fidgeon, split]   30
1    IMOJEAN      [Benet, split]   21
2    MICHELE  [Woodlands, split]   29
3    AILBERT    [Risdale, split]   22
4      STEVY  [MacGorman, split]   24

In [13]:
# -- Contatenar nuevos registros a nivel filas
new_clients = pd.DataFrame({'first_name' : ['Rebe'],
                            'last_name' : ['MacCrossan concat'],
                            'age' : [21]},
                           columns = ['first_name', 'last_name', 'age'])
clients = pd.concat([clients, new_clients])
clients

  first_name           last_name  age
0     ORALIE    [Fidgeon, split]   30
1    IMOJEAN      [Benet, split]   21
2    MICHELE  [Woodlands, split]   29
3    AILBERT    [Risdale, split]   22
4      STEVY  [MacGorman, split]   24
0       Rebe   MacCrossan concat   21

In [15]:
# actualizar los indices
clients.index = range(clients.shape[0])
clients

  first_name           last_name  age
0     ORALIE    [Fidgeon, split]   30
1    IMOJEAN      [Benet, split]   21
2    MICHELE  [Woodlands, split]   29
3    AILBERT    [Risdale, split]   22
4      STEVY  [MacGorman, split]   24
5       Rebe   MacCrossan concat   21

In [16]:
# -- Contatenar nuevos registros nivel columnas - agrega columna client_id
ids = pd.DataFrame({'client_id': [1, 2, 3, 4, 5, 6]}, columns = ['client_id'])
clients = pd.concat([ids, clients], axis=1,)
clients

   client_id first_name           last_name  age
0          1     ORALIE    [Fidgeon, split]   30
1          2    IMOJEAN      [Benet, split]   21
2          3    MICHELE  [Woodlands, split]   29
3          4    AILBERT    [Risdale, split]   22
4          5      STEVY  [MacGorman, split]   24
5          6       Rebe   MacCrossan concat   21

In [17]:
# -- Uni√≥n de los dataframes
pd.merge(clients, invoices, left_on='client_id', right_on='client_id')

   client_id first_name           last_name  age  invoice_id  amount
0          1     ORALIE    [Fidgeon, split]   30           7   45.77
1          2    IMOJEAN      [Benet, split]   21           2   24.36
2          2    IMOJEAN      [Benet, split]   21           4   19.75
3          2    IMOJEAN      [Benet, split]   21           9   14.41
4          2    IMOJEAN      [Benet, split]   21          12   12.78
5          3    MICHELE  [Woodlands, split]   29           1   77.91
6          3    MICHELE  [Woodlands, split]   29           6   17.13
7          3    MICHELE  [Woodlands, split]   29          10   52.69
8          4    AILBERT    [Risdale, split]   22           8   81.70
9          6       Rebe   MacCrossan concat   21          11   32.03